## dev: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 14 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                 NAME                                  |
|----------|-----------------------------------------------------------------------|
| add      | `module.cbs_logs_bucket[0].aws_s3_bucket.this`                        |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_acl.this`                    |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this`     |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_policy.this`                 |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this`    |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this`             |
| update   | `aws_athena_named_query.create_table_alb_logs`                        |
|          | `aws_athena_named_query.create_table_all_waf_logs`                    |
|          | `aws_athena_named_query.create_table_waf_logs`                        |
|          | `aws_athena_named_query.create_table_waf_logs_api_lambda`             |
|          | `aws_budgets_budget.notify_global`                                    |
|          | `aws_s3_bucket_policy.alb_log_bucket_allow_elb_account`               |
|          | `aws_s3_bucket_policy.sns_sms_usage_report_bucket_policy`             |
|          | `aws_s3_bucket_policy.sns_sms_usage_report_bucket_us_west_2_policy`   |
|          | `aws_sns_sms_preferences.update-sms-prefs`                            |
|          | `aws_sns_sms_preferences.update-sms-prefs-us-west-2`                  |
|          | `aws_sns_topic.notification-canada-ca-alert-general`                  |
|          | `aws_sqs_queue.eks_notification_canada_cadelivery_receipts`           |
|          | `aws_sqs_queue.notify_internal_tasks_queue`                           |
|          | `module.budget_notifier.aws_lambda_function.spend_notifier`           |
| recreate | `aws_athena_workgroup.primary`                                        |
|          | `module.notify_slack_critical.module.lambda.null_resource.archive[0]` |
|          | `module.notify_slack_general.module.lambda.null_resource.archive[0]`  |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`       |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_athena_named_query.create_table_alb_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_alb_logs" {
        id          = "af0122ce-b25b-43af-992c-7c4c484b852d"
        name        = "create_table_alb_logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_all_waf_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_all_waf_logs" {
        id          = "6d2876b9-8118-4308-819a-9cc455c87208"
        name        = "WAF: create table waf_logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_waf_logs will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_waf_logs" {
        id          = "53af72ab-e002-47fc-8357-d429219da6a1"
        name        = "WAF: create table waf_logs_lb"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_named_query.create_table_waf_logs_api_lambda will be updated in-place
  ~ resource "aws_athena_named_query" "create_table_waf_logs_api_lambda" {
        id          = "f6da2959-41f6-49f1-a97b-ca2ce8d759c9"
        name        = "WAF: create table waf_logs_api_lambda"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ query       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_athena_workgroup.primary must be replaced
-/+ resource "aws_athena_workgroup" "primary" {
      ~ arn           = "arn:aws:athena:ca-central-1:800095993820:workgroup/athenawg" -> (known after apply)
      ~ id            = "athenawg" -> (known after apply)
      ~ name          = "athenawg" -> "primary" # forces replacement
        tags          = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (4 unchanged attributes hidden)

      ~ configuration {
          - bytes_scanned_cutoff_per_query     = 0 -> null
            # (4 unchanged attributes hidden)

          - engine_version {
              - effective_engine_version = "Athena engine version 3" -> null
              - selected_engine_version  = "AUTO" -> null
            }

            # (1 unchanged block hidden)
        }
    }

  # aws_budgets_budget.notify_global will be updated in-place
  ~ resource "aws_budgets_budget" "notify_global" {
        id                = "800095993820:notify-global-budget"
      ~ limit_amount      = "3000.0" -> "5000"
        name              = "notify-global-budget"
        tags              = {}
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.alb_log_bucket_allow_elb_account will be updated in-place
  ~ resource "aws_s3_bucket_policy" "alb_log_bucket_allow_elb_account" {
        id     = "notification-canada-ca-dev-alb-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.sns_sms_usage_report_bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "sns_sms_usage_report_bucket_policy" {
        id     = "notification-canada-ca-dev-sms-usage-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.sns_sms_usage_report_bucket_us_west_2_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "sns_sms_usage_report_bucket_us_west_2_policy" {
        id     = "notification-canada-ca-dev-sms-usage-west-2-logs"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_sns_sms_preferences.update-sms-prefs will be updated in-place
  ~ resource "aws_sns_sms_preferences" "update-sms-prefs" {
        id                                    = "aws_sns_sms_id"
      ~ monthly_spend_limit                   = 1 -> 100
        # (5 unchanged attributes hidden)
    }

  # aws_sns_sms_preferences.update-sms-prefs-us-west-2 will be updated in-place
  ~ resource "aws_sns_sms_preferences" "update-sms-prefs-us-west-2" {
        id                                    = "aws_sns_sms_id"
      ~ monthly_spend_limit                   = 1 -> 30
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic.notification-canada-ca-alert-general will be updated in-place
  ~ resource "aws_sns_topic" "notification-canada-ca-alert-general" {
        id                                       = "arn:aws:sns:ca-central-1:800095993820:alert-general"
        name                                     = "alert-general"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy                                   = (sensitive value)
        tags                                     = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.eks_notification_canada_cadelivery_receipts will be updated in-place
  ~ resource "aws_sqs_queue" "eks_notification_canada_cadelivery_receipts" {
        id                                = "https://sqs.ca-central-1.amazonaws.com/800095993820/eks-notification-canada-cadelivery-receipts"
        name                              = "eks-notification-canada-cadelivery-receipts"
        tags                              = {
            "Environment" = "dev"
        }
      ~ visibility_timeout_seconds        = 305 -> 310
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.notify_internal_tasks_queue will be updated in-place
  ~ resource "aws_sqs_queue" "notify_internal_tasks_queue" {
        id                                = "https://sqs.ca-central-1.amazonaws.com/800095993820/eks-notification-canada-canotify-internal-tasks"
        name                              = "eks-notification-canada-canotify-internal-tasks"
        tags                              = {}
      ~ visibility_timeout_seconds        = 305 -> 310
        # (18 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend[0]
    resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
        id                  = "dailyBudgetSpend"
        name                = "dailyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend[0]
    resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
        id                  = "weeklyBudgetSpend"
        name                = "weeklyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend[0]
    resource "aws_cloudwatch_event_target" "daily_budget_spend" {
        id             = "dailyBudgetSpend-terraform-2024082912294855890000001a"
        # (8 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend[0]
    resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
        id             = "weeklyBudgetSpend-terraform-20240829122948443900000019"
        # (8 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_function.spend_notifier will be updated in-place
  ~ resource "aws_lambda_function" "spend_notifier" {
        id                             = "spend_notifier"
      ~ last_modified                  = "2024-08-29T12:28:33.247+0000" -> (known after apply)
      ~ runtime                        = "nodejs16.x" -> "nodejs20.x"
      ~ source_code_hash               = "KqgaQgrKH72tPtzVxEXFeT0UIdVJmB8W7Q3/O5onycQ=" -> "1vH83BDA1sIoBtTcwyvC2n+w932l6mJkelGZEWjy0pU="
        tags                           = {
            "CostCentre" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_daily_budget has moved to module.budget_notifier.aws_lambda_permission.allow_daily_budget[0]
    resource "aws_lambda_permission" "allow_daily_budget" {
        id                  = "AllowDailyBudget"
        # (7 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_weekly_budget has moved to module.budget_notifier.aws_lambda_permission.allow_weekly_budget[0]
    resource "aws_lambda_permission" "allow_weekly_budget" {
        id                  = "AllowWeeklyBudget"
        # (7 unchanged attributes hidden)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSELBLogDeliveryWrite"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::985666609251:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cbs-satellite-800095993820"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-dev"
          + "CostCentre" = "notification-canada-ca-dev"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-dev"
          + "CostCentre" = "notification-canada-ca-dev"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7771725994183253947" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1725911253958161200" -> "1726687558571594000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3260129362866367981" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1725911252889239000" -> "1726687557472910000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2897430052752886473" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1725911253909317000" -> "1726687558432522000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1120655620850197150" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1725911253907796000" -> "1726687558425683000"
            # (1 unchanged element hidden)
        }
    }

Plan: 11 to add, 14 to change, 5 to destroy.

Changes to Outputs:
  ~ cbs_satellite_bucket_name                           = "" -> "cbs-satellite-800095993820"
  ~ sns_monthly_spend_limit                             = 1 -> 100

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 67 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw-k8s[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw-k8s[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw-k8s[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.cloud-based-sensor"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.iam_lambda_to_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sns-delivery-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_service_linked_role.spotInstances"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
